---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType
source: html/40d48742-9b8f-98a6-1785-91123708e238.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType

Defines text visualization types for vector settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleVectorTextType
```